list_of_dicts = [
    {
        'Барнаул': 4,
        'Владивосток': 3,
        'Волгоград': 2,
        'Нижний Новгород': 8,
        'Санкт-Петербург': 4,
        'Ульяновск': 8,
        'Уфа': 7,
        'Хабаровск': 2,
        'Ярославль': 1
    },
    {
        'Владивосток': 3,
        'Воронеж': 4,
        'Казань': 2,
        'Москва': 8,
        'Новокузнецк': 3,
        'Новосибирск': 4,
        'Омск': 1,
        'Пермь': 2,
        'Тольятти': 1,
        'Уфа': 3
    },
    {
        'Барнаул': 1,
        'Владивосток': 1,
        'Волгоград': 9,
        'Москва': 1,
        'Новосибирск': 6,
        'Санкт-Петербург': 3,
        'Ульяновск': 9
    },
    {
        'Владивосток': 1,
        'Воронеж': 3,
        'Екатеринбург': 6,
        'Оренбург': 3,
        'Санкт-Петербург': 8,
        'Тольятти': 2
    }
]

keys_list = []
for i in range(len(list_of_dicts)):
    keys_list.extend(list(key for key in list_of_dicts[0]))
keys_set = set(keys_list)

result_dict = dict()
for town in keys_set:
    result_set = set()
    for record in list_of_dicts:
        for key, value in record.items():
            if key == town:
                result_set.add(value)
    result_dict[town] = result_set

for key, value in result_dict.items():
    print(f'{key}: {value},')

# Волгоград: {9, 2},
# Хабаровск: {2},
# Санкт-Петербург: {8, 3, 4},
# Уфа: {3, 7},
# Ярославль: {1},
# Ульяновск: {8, 9},
# Владивосток: {1, 3},
# Нижний Новгород: {8},
# Барнаул: {1, 4},
